Repository: yoko-at-home/reactjs-docs-TM
Catalog: docs/faq-styling_EN-US_ja.tmx
Source language: en_us
Languages: ja

source: --- id: faq-styling title: Styling and CSS permalink: docs/faq-styling.html layout: docs category: FAQ ---
ja: --- id: faq-styling title: CSS とスタイルの使用 permalink: docs/faq-styling.html layout: docs category: FAQ ---

source: ### How do I add CSS classes to components?
ja: ### CSS のクラスをコンポーネントに適用するにはどうすれば？

source: Pass a string as the `className` prop:
ja: このようにクラス名を文字列として `className` プロパティに与えてください。

source: It is common for CSS classes to depend on the component props or state:
ja: このようにコンポーネントの props や state の状態を元に CSS クラスを割り当てる方法もよく使用されています。

source: >Tip > >If you often find yourself writing code like this, [classnames](https://www.npmjs.com/package/classnames#usage-with-reactjs) package can simplify it.
ja: >ヒント > >もしあなたが上記のようなコードを書くことが多い場合、[classnames](https://www.npmjs.com/package/classnames#usage-with-reactjs) という npm パッケージを使うことで簡略化できます。

source: ### Can I use inline styles?
ja: ### インラインスタイルは使えますか？

source: Yes, see the docs on styling [here](/docs/dom-elements.html#style).
ja: はい、スタイルの書き方については[この資料](/docs/dom-elements.html#style)をご覧ください。

source: ### Are inline styles bad?
ja: ### インラインスタイルは悪なの？

source: CSS classes are generally better for performance than inline styles.
ja: パフォーマンス観点から言えば、基本的に CSS クラスを使う方が、インラインスタイルを用いるよりも優れています。

source: ### What is CSS-in-JS?
ja: ### CSS-in-JS とは?

source: "CSS-in-JS" refers to a pattern where CSS is composed using JavaScript instead of defined in external files.
ja: "CSS-in-JS" とは外部ファイルでスタイルを定義するのとは違い、JavaScript を用いて CSS を生成するパターンのことを指します。_注意：この機能は React の一部ではありません。

source: _Note that this functionality is not a part of React, but provided by third-party libraries._ React does not have an opinion about how styles are defined; if in doubt, a good starting point is to define your styles in a separate `*.css` file as usual and refer to them using [`className`](/docs/dom-elements.html#classname).
ja: _React はスタイルがどのように定義されているかには関心を持ちません。判断に困った場合は、まずは別の `*.css` にスタイルを定義して、[`className`](/docs/dom-elements.html#classname) を使って参照するところからはじめると良いでしょう。

source: ### Can I do animations in React?
ja: ### React でアニメーションは使えますか？

source: React can be used to power animations.
ja: React を使ってアニメーションを動かすことは可能です。

source: See [React Transition Group](https://reactcommunity.org/react-transition-group/) and [React Motion](https://github.com/chenglou/react-motion) or [React Spring](https://github.com/react-spring/react-spring), for example.
ja: 例として、[React Transition Group](https://reactcommunity.org/react-transition-group/) や [React Motion](https://github.com/chenglou/react-motion)、[React Spring](https://github.com/react-spring/react-spring) をご覧ください。
